In [5]:
import pandas as pd
import seaborn as sns

In [9]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
df.describe()
# 숫자로 되어있는 데이터만을 보여준다. 
# 평균값 등의 숫자 데이터 계산을 보여주므로
#문자열의 경우 다른 계산을 해야한다. `describe`가 아닌

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [12]:
df.describe(include='object')
# 글자 데이터를 포함해서 보여줘~
# top: 그 중에서 가장 많이 나타난 데이터
# freq: 가장 많이 나타난 데이터가 몇 번 등장 했는지의 숫자값

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## count()

In [13]:
df.count()
# df의 모든 데이터 (NaN값은 빼고)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [14]:
# 내가 원하는 데이터 컬럼에 직접적으로 들어가서 count 할 수도 있다. 
df['age'].count()

np.int64(714)

## mean()

In [15]:
df['age'].mean()

np.float64(29.69911764705882)

In [27]:
# df.mean()
# df자체에는 평균을 계산 할 수 없는 값들도 존재하기에 error
df.mean(numeric_only=True)
#숫자만으로 평균 구해줘요잉~
# 결측치 (NaN)이 너무 많아, 그건 빼고 계산해줘잉~
# =>
df.mean(numeric_only=True, skipna=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [19]:
#df안의 정보를 먼저 살펴보고 
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [21]:
# 성인 남성 요금 평균을 구하고 싶어요
# condition 을 만들고, 그 condition에 맞는 조건 찾기중
cond = df['adult_male'] ==  True
df.loc[cond, 'fare'].mean()

np.float64(24.864181750465548)

In [22]:
# fare 30 ~ 40 지불 승객 & 1등석 => 나이 평균
cond1 = df['fare'] >= 30
cond2 = df['fare'] <= 40

cond3 = df['pclass'] == 1

df.loc[cond1 & cond2 & cond3, 'age'].mean()

np.float64(44.095238095238095)

## median()

In [ ]:
# titanic 데이터로는 중앙값 median()을 확인하기 어려워서, pandas - Series를 만들어서 연습하겠습니다.

In [30]:
numbers = [1, 2, 10, 11, 100, 1000]
pd.Series(numbers).mean()

np.float64(187.33333333333334)

In [32]:
pd.Series(numbers).median()
# median() = 가운데 지점의 '중앙값'을 출력해준다. 
# 짝수개의 데이터라면 => 중앙 2 데이터의 평균을 출력해준다.

np.float64(10.5)

In [36]:
mean_value = df['age'].mean()
median_value = df['age'].median()
print(mean_value, median_value)

# 만일, mean과 median이 엄청 큰 차이가 있다면, 데이터 내에 엄청 큰 값이나 엄청 작은 값이 포함되었겠구나라고 알 수 있음.

29.69911764705882 28.0

## sum()

In [37]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [39]:
df['fare'].sum()
# 특정 column의 총합 sum()도 출력이 가능하다.

np.float64(28693.9493)

In [41]:
df['fare'].cumsum()
# 쓸일이 거의 없지만
# 누적합의 결과를 알고 싶다면 : cumsum()

0          7.2500
1         78.5333
2         86.4583
3        139.5583
4        147.6083
          ...
886    28602.7493
887    28632.7493
888    28656.1993
889    28686.1993
890    28693.9493
Name: fare, Length: 891, dtype: float64

In [44]:
df['age'].cumprod()
# 누적곱도 알 수 있다. : cumprod()
# 이것도 거의 쓰이지 않는다.

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

## var() 분산

In [51]:
fare_mean = df['fare'].mean()
# fare_mean

total = ((df['fare'] - fare_mean) ** 2).sum()
# fare 컬럼의 Series에서 fare_mean을 뺀다. => 그리고 그 연산결과를 제곱한다 : '분산'을 구하는 중입니다. 
total_count = df['fare'].count() - 1 # => 표본분산 (; normalised by n-1 by default. // 모분산: -1 을 하지 않는다.)


my_var = total / total_count
print(my_var)
# 분산을 구하는 과정을 함수 대신에 직접 해본 결과값입니다.

2469.436845743116

In [50]:
df['fare'].var()
# pandas가 가지고 있는 분산을 구하는 `var()` 함수 사용으로 쉽게 `var` 을 구함.

np.float64(2469.436845743116)

## std() 표준편차
- 분산에 루트를 씌워주세용~

In [55]:
import numpy as np
# 분산 (df['fare'].var()) => 에 sqrt 씌우면 표준편차
np.sqrt(df['fare'].var())

np.float64(49.6934285971809)

## min(), max()

In [57]:
df['age'].min()
df['age'].max()

np.float64(80.0)

## agg() (aggregation)
> 통계정보를 하나의 표로 보고 싶다면

In [60]:
df['age'].agg(['max', 'min', 'count', 'mean'])
# 특정한 column을 먼저 선택하고 - 그안에서 뽑고 싶은 통계정보를 .agg(에 넣는다.)

max       80.000000
min        0.420000
count    714.000000
mean      29.699118
Name: age, dtype: float64

In [63]:
df[['age', 'fare']].agg(['min', 'max'])
# 두개의 column 을 골라서 그 안의 데이터 중 'min'과 'max' 를 불러오는 방식을 보이는 중~

       age      fare
min   0.42    0.0000
max  80.00  512.3292

## quantile() (분위)

In [65]:
df['age'].quantile(0.1)
#'age'기준 - 하위 10%의 위치를 출력
df['age'].quantile(0.8)
#'age'기준 - 상위 20%를 출력

np.float64(41.0)

In [68]:
df['age'].median()
df['age'].quantile(0.5)
# 이둘은 같은 결과값을 보임.

np.float64(28.0)

## unique()
> 글자에서의 연산
>> 성별이나 어느정도 확인이 가능한 (이름과 같은 너무 많은 경우가 나타나는 경우에는 적용하기에 x)

In [69]:
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [71]:
df['who'].nunique()

3

## mode()
> 최빈값을 확인 할 때: 가장 많이 등장한 데이터

In [72]:
df['who'].mode()

0    man
Name: who, dtype: object

In [74]:
df['deck'].mode()
# spectrum 이 좁아 (A~G), category 형태의 데이터타입으로 보이게된다.

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

## corr()
> 거의 모든 연산을 가능하게 해주는
>> `상관관계`를 보여주는 함수:
>> 각 column 끼리의 상관관계를 `-1부터 1`까지로 표현

In [75]:
df.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [76]:
df.corr(numeric_only=True)['survived']
# 보고싶은 column만 따로 빼서도 출력이 가능하다.

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64